; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	infrared1 - mode
	thermograph2 - mode
	infrared4 - mode
	infrared3 - mode
	image0 - mode
	Star0 - direction
	Star1 - direction
	GroundStation11 - direction
	GroundStation15 - direction
	GroundStation28 - direction
	GroundStation29 - direction
	Star3 - direction
	Star20 - direction
	Star39 - direction
	Star26 - direction
	Star8 - direction
	Star25 - direction
	Star2 - direction
	GroundStation7 - direction
	GroundStation36 - direction
	GroundStation5 - direction
	GroundStation33 - direction
	GroundStation27 - direction
	Star30 - direction
	Star24 - direction
	Star13 - direction
	GroundStation22 - direction
	Star35 - direction
	Star9 - direction
	GroundStation17 - direction
	Star12 - direction
	GroundStation32 - direction
	GroundStation18 - direction
	Star37 - direction
	GroundStation34 - direction
	GroundStation21 - direction
	Star10 - direction
	Star19 - direction
	Star14 - direction
	Star31 - direction
	GroundStation6 - direction
	Star16 - direction
	GroundStation4 - direction
	Star38 - direction
	Star23 - direction
	Phenomenon40 - direction
	Star41 - direction
	Star42 - direction
	Planet43 - direction
	Star44 - direction
	Phenomenon45 - direction
	Phenomenon46 - direction
	Planet47 - direction
	Planet48 - direction
	Phenomenon49 - direction
	Planet50 - direction
	Planet51 - direction
	Phenomenon52 - direction
	Phenomenon53 - direction
	Phenomenon54 - direction
	Planet55 - direction
	Phenomenon56 - direction
	Phenomenon57 - direction
	Phenomenon58 - direction
	Phenomenon59 - direction
	Star60 - direction
	Star61 - direction
	Star62 - direction
	Phenomenon63 - direction
	Planet64 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star20)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star19)
	(calibration_target instrument0 Star16)
	(calibration_target instrument0 Star23)
	(calibration_target instrument0 Star37)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star26)
	(calibration_target instrument1 GroundStation21)
	(calibration_target instrument1 Star39)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation33)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation17)
	(calibration_target instrument1 Star19)
	(calibration_target instrument1 GroundStation34)
	(supports instrument2 infrared3)
	(supports instrument2 infrared4)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star19)
	(calibration_target instrument2 Star8)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared4)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation27)
	(calibration_target instrument3 Star25)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 GroundStation18)
	(calibration_target instrument3 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation36)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star30)
	(calibration_target instrument4 GroundStation34)
	(calibration_target instrument4 GroundStation27)
	(calibration_target instrument4 GroundStation33)
	(calibration_target instrument4 Star16)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 GroundStation36)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 Star38)
	(calibration_target instrument4 GroundStation17)
	(calibration_target instrument4 GroundStation22)
	(calibration_target instrument4 Star2)
	(supports instrument5 image0)
	(supports instrument5 infrared3)
	(supports instrument5 infrared4)
	(calibration_target instrument5 Star12)
	(calibration_target instrument5 GroundStation32)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 GroundStation17)
	(calibration_target instrument5 Star35)
	(calibration_target instrument5 GroundStation22)
	(calibration_target instrument5 Star31)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 Star24)
	(calibration_target instrument5 Star37)
	(supports instrument6 infrared3)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 GroundStation17)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation17)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation18)
	(calibration_target instrument7 GroundStation32)
	(calibration_target instrument7 Star12)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star19)
	(supports instrument8 infrared3)
	(supports instrument8 image0)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 Star23)
	(calibration_target instrument8 Star38)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 Star16)
	(calibration_target instrument8 GroundStation6)
	(calibration_target instrument8 Star31)
	(calibration_target instrument8 Star14)
	(calibration_target instrument8 Star19)
	(calibration_target instrument8 Star10)
	(calibration_target instrument8 GroundStation21)
	(calibration_target instrument8 GroundStation34)
	(calibration_target instrument8 Star37)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star20)
)
(:goal (and
	(pointing satellite0 Planet50)
	(pointing satellite1 Phenomenon54)
	(pointing satellite3 GroundStation15)
	(have_image Phenomenon40 image0)
	(have_image Star41 thermograph2)
	(have_image Star42 infrared1)
	(have_image Planet43 infrared3)
	(have_image Star44 infrared3)
	(have_image Phenomenon45 thermograph2)
	(have_image Phenomenon46 thermograph2)
	(have_image Planet47 infrared3)
	(have_image Planet48 infrared1)
	(have_image Phenomenon49 infrared1)
	(have_image Planet50 infrared1)
	(have_image Planet51 infrared4)
	(have_image Phenomenon52 image0)
	(have_image Phenomenon53 infrared1)
	(have_image Phenomenon54 infrared4)
	(have_image Planet55 thermograph2)
	(have_image Phenomenon56 infrared1)
	(have_image Phenomenon57 infrared1)
	(have_image Phenomenon58 infrared1)
	(have_image Phenomenon59 thermograph2)
	(have_image Star60 thermograph2)
	(have_image Star61 infrared4)
	(have_image Star62 infrared1)
	(have_image Phenomenon63 infrared4)
	(have_image Planet64 infrared1)
))

)

; plan
1. (switch_on instrument6 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument6)
   goals met: 0 of 28
2. (calibrate satellite1 instrument6 groundstation17)
   added: (calibrated instrument6)
   goals met: 0 of 28
3. (switch_on instrument3 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument3)
   goals met: 0 of 28
4. (turn_to satellite3 groundstation15 star20)
   deleted: (pointing satellite3 star20)
   added: (pointing satellite3 groundstation15)
   goals met: 1 of 28
5. (turn_to satellite1 phenomenon45 groundstation17)
   deleted: (pointing satellite1 groundstation17)
   added: (pointing satellite1 phenomenon45)
   goals met: 1 of 28
6. (take_image satellite1 phenomenon45 instrument6 thermograph2)
   added: (have_image phenomenon45 thermograph2)
   goals met: 2 of 28
7. (turn_to satellite1 phenomenon46 phenomenon45)
   deleted: (pointing satellite1 phenomenon45)
   added: (pointing satellite1 phenomenon46)
   goals met: 2 of 28
8. (take_image satellite1 phenomenon46 instrument6 thermograph2)
   added: (have_image phenomenon46 thermograph2)
   goals met: 3 of 28
9. (turn_to satellite1 phenomenon49 phenomenon46)
   deleted: (pointing satellite1 phenomenon46)
   added: (pointing satellite1 phenomenon49)
   goals met: 3 of 28
10. (take_image satellite1 phenomenon49 instrument6 infrared1)
   added: (have_image phenomenon49 infrared1)
   goals met: 4 of 28
11. (turn_to satellite1 phenomenon53 phenomenon49)
   deleted: (pointing satellite1 phenomenon49)
   added: (pointing satellite1 phenomenon53)
   goals met: 4 of 28
12. (take_image satellite1 phenomenon53 instrument6 infrared1)
   added: (have_image phenomenon53 infrared1)
   goals met: 5 of 28
13. (turn_to satellite1 phenomenon54 phenomenon53)
   deleted: (pointing satellite1 phenomenon53)
   added: (pointing satellite1 phenomenon54)
   goals met: 6 of 28
14. (turn_to satellite0 phenomenon40 groundstation36)
   deleted: (pointing satellite0 groundstation36)
   added: (pointing satellite0 phenomenon40)
   goals met: 6 of 28
15. (turn_to satellite1 phenomenon56 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 phenomenon56)
   goals met: 5 of 28
16. (take_image satellite1 phenomenon56 instrument6 infrared1)
   added: (have_image phenomenon56 infrared1)
   goals met: 6 of 28
17. (turn_to satellite1 phenomenon54 phenomenon56)
   deleted: (pointing satellite1 phenomenon56)
   added: (pointing satellite1 phenomenon54)
   goals met: 7 of 28
18. (turn_to satellite1 phenomenon57 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 phenomenon57)
   goals met: 6 of 28
19. (take_image satellite1 phenomenon57 instrument6 infrared1)
   added: (have_image phenomenon57 infrared1)
   goals met: 7 of 28
20. (turn_to satellite1 phenomenon54 phenomenon57)
   deleted: (pointing satellite1 phenomenon57)
   added: (pointing satellite1 phenomenon54)
   goals met: 8 of 28
21. (turn_to satellite1 phenomenon58 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 phenomenon58)
   goals met: 7 of 28
22. (take_image satellite1 phenomenon58 instrument6 infrared1)
   added: (have_image phenomenon58 infrared1)
   goals met: 8 of 28
23. (turn_to satellite1 phenomenon54 phenomenon58)
   deleted: (pointing satellite1 phenomenon58)
   added: (pointing satellite1 phenomenon54)
   goals met: 9 of 28
24. (turn_to satellite1 phenomenon59 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 phenomenon59)
   goals met: 8 of 28
25. (take_image satellite1 phenomenon59 instrument6 thermograph2)
   added: (have_image phenomenon59 thermograph2)
   goals met: 9 of 28
26. (turn_to satellite1 phenomenon54 phenomenon59)
   deleted: (pointing satellite1 phenomenon59)
   added: (pointing satellite1 phenomenon54)
   goals met: 10 of 28
27. (turn_to satellite1 planet43 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 planet43)
   goals met: 9 of 28
28. (take_image satellite1 planet43 instrument6 infrared3)
   added: (have_image planet43 infrared3)
   goals met: 10 of 28
29. (turn_to satellite1 phenomenon54 planet43)
   deleted: (pointing satellite1 planet43)
   added: (pointing satellite1 phenomenon54)
   goals met: 11 of 28
30. (turn_to satellite1 planet47 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 planet47)
   goals met: 10 of 28
31. (take_image satellite1 planet47 instrument6 infrared3)
   added: (have_image planet47 infrared3)
   goals met: 11 of 28
32. (turn_to satellite1 phenomenon54 planet47)
   deleted: (pointing satellite1 planet47)
   added: (pointing satellite1 phenomenon54)
   goals met: 12 of 28
33. (turn_to satellite1 planet48 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 planet48)
   goals met: 11 of 28
34. (take_image satellite1 planet48 instrument6 infrared1)
   added: (have_image planet48 infrared1)
   goals met: 12 of 28
35. (turn_to satellite1 phenomenon54 planet48)
   deleted: (pointing satellite1 planet48)
   added: (pointing satellite1 phenomenon54)
   goals met: 13 of 28
36. (turn_to satellite1 planet50 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 planet50)
   goals met: 12 of 28
37. (take_image satellite1 planet50 instrument6 infrared1)
   added: (have_image planet50 infrared1)
   goals met: 13 of 28
38. (turn_to satellite1 phenomenon54 planet50)
   deleted: (pointing satellite1 planet50)
   added: (pointing satellite1 phenomenon54)
   goals met: 14 of 28
39. (turn_to satellite1 planet55 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 planet55)
   goals met: 13 of 28
40. (take_image satellite1 planet55 instrument6 thermograph2)
   added: (have_image planet55 thermograph2)
   goals met: 14 of 28
41. (turn_to satellite1 phenomenon54 planet55)
   deleted: (pointing satellite1 planet55)
   added: (pointing satellite1 phenomenon54)
   goals met: 15 of 28
42. (turn_to satellite1 planet64 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 planet64)
   goals met: 14 of 28
43. (take_image satellite1 planet64 instrument6 infrared1)
   added: (have_image planet64 infrared1)
   goals met: 15 of 28
44. (turn_to satellite1 phenomenon54 planet64)
   deleted: (pointing satellite1 planet64)
   added: (pointing satellite1 phenomenon54)
   goals met: 16 of 28
45. (turn_to satellite1 star41 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 star41)
   goals met: 15 of 28
46. (take_image satellite1 star41 instrument6 thermograph2)
   added: (have_image star41 thermograph2)
   goals met: 16 of 28
47. (turn_to satellite1 phenomenon54 star41)
   deleted: (pointing satellite1 star41)
   added: (pointing satellite1 phenomenon54)
   goals met: 17 of 28
48. (turn_to satellite1 star42 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 star42)
   goals met: 16 of 28
49. (take_image satellite1 star42 instrument6 infrared1)
   added: (have_image star42 infrared1)
   goals met: 17 of 28
50. (turn_to satellite1 phenomenon54 star42)
   deleted: (pointing satellite1 star42)
   added: (pointing satellite1 phenomenon54)
   goals met: 18 of 28
51. (turn_to satellite1 star44 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 star44)
   goals met: 17 of 28
52. (take_image satellite1 star44 instrument6 infrared3)
   added: (have_image star44 infrared3)
   goals met: 18 of 28
53. (turn_to satellite1 phenomenon54 star44)
   deleted: (pointing satellite1 star44)
   added: (pointing satellite1 phenomenon54)
   goals met: 19 of 28
54. (turn_to satellite1 star60 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 star60)
   goals met: 18 of 28
55. (take_image satellite1 star60 instrument6 thermograph2)
   added: (have_image star60 thermograph2)
   goals met: 19 of 28
56. (turn_to satellite1 phenomenon54 star60)
   deleted: (pointing satellite1 star60)
   added: (pointing satellite1 phenomenon54)
   goals met: 20 of 28
57. (turn_to satellite1 star62 phenomenon54)
   deleted: (pointing satellite1 phenomenon54)
   added: (pointing satellite1 star62)
   goals met: 19 of 28
58. (take_image satellite1 star62 instrument6 infrared1)
   added: (have_image star62 infrared1)
   goals met: 20 of 28
59. (turn_to satellite1 phenomenon54 star62)
   deleted: (pointing satellite1 star62)
   added: (pointing satellite1 phenomenon54)
   goals met: 21 of 28
60. (turn_to satellite0 star25 phenomenon40)
   deleted: (pointing satellite0 phenomenon40)
   added: (pointing satellite0 star25)
   goals met: 21 of 28
61. (calibrate satellite0 instrument3 star25)
   added: (calibrated instrument3)
   goals met: 21 of 28
62. (turn_to satellite0 phenomenon40 star25)
   deleted: (pointing satellite0 star25)
   added: (pointing satellite0 phenomenon40)
   goals met: 21 of 28
63. (take_image satellite0 phenomenon40 instrument3 image0)
   added: (have_image phenomenon40 image0)
   goals met: 22 of 28
64. (turn_to satellite0 phenomenon52 phenomenon40)
   deleted: (pointing satellite0 phenomenon40)
   added: (pointing satellite0 phenomenon52)
   goals met: 22 of 28
65. (take_image satellite0 phenomenon52 instrument3 image0)
   added: (have_image phenomenon52 image0)
   goals met: 23 of 28
66. (turn_to satellite0 phenomenon54 phenomenon52)
   deleted: (pointing satellite0 phenomenon52)
   added: (pointing satellite0 phenomenon54)
   goals met: 23 of 28
67. (take_image satellite0 phenomenon54 instrument3 infrared4)
   added: (have_image phenomenon54 infrared4)
   goals met: 24 of 28
68. (turn_to satellite0 phenomenon63 phenomenon54)
   deleted: (pointing satellite0 phenomenon54)
   added: (pointing satellite0 phenomenon63)
   goals met: 24 of 28
69. (take_image satellite0 phenomenon63 instrument3 infrared4)
   added: (have_image phenomenon63 infrared4)
   goals met: 25 of 28
70. (turn_to satellite0 planet50 phenomenon63)
   deleted: (pointing satellite0 phenomenon63)
   added: (pointing satellite0 planet50)
   goals met: 26 of 28
71. (turn_to satellite0 planet51 planet50)
   deleted: (pointing satellite0 planet50)
   added: (pointing satellite0 planet51)
   goals met: 25 of 28
72. (take_image satellite0 planet51 instrument3 infrared4)
   added: (have_image planet51 infrared4)
   goals met: 26 of 28
73. (turn_to satellite0 planet50 planet51)
   deleted: (pointing satellite0 planet51)
   added: (pointing satellite0 planet50)
   goals met: 27 of 28
74. (turn_to satellite0 star61 planet50)
   deleted: (pointing satellite0 planet50)
   added: (pointing satellite0 star61)
   goals met: 26 of 28
75. (take_image satellite0 star61 instrument3 infrared4)
   added: (have_image star61 infrared4)
   goals met: 27 of 28
76. (turn_to satellite0 planet50 star61)
   deleted: (pointing satellite0 star61)
   added: (pointing satellite0 planet50)
   goals met: 28 of 28
